In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("june_2025_sales_data.csv")

In [7]:
df.isna().sum()

Date            0
Product         5
Quantity        5
Cost            5
Sales_Amount    5
dtype: int64

In [15]:
clean_df=df.dropna(subset=["Product", "Quantity", "Cost"])
clean_df.isna().sum()

Date            0
Product         0
Quantity        0
Cost            0
Sales_Amount    0
dtype: int64

In [16]:
clean_df.describe()

        Quantity       Cost  Sales_Amount
count  25.000000  25.000000      25.00000
mean    6.680000  31.432000     285.03240
std     2.641338  13.801266     180.66007
min     2.000000   9.020000      39.90000
25%     5.000000  20.060000     207.51000
50%     7.000000  31.440000     266.50000
75%     9.000000  44.770000     344.64000
max    10.000000  49.440000     728.26000

In [18]:
clean_df.groupby("Product").agg({
    "Quantity": "mean",
    "Cost" : ["mean", "max", "min"]
})

          Quantity       Cost
              mean       mean    max    min
Product
Device E  6.666667  38.333333  49.44  25.53
Gadget C  6.000000  23.600000  48.35   9.02
Gizmo D   6.800000  32.308000  46.62  10.57
Widget A  7.666667  30.635000  45.00   9.68
Widget B  5.000000  45.250000  45.25  45.25